Revit 2027 API
DuctFittingAndAccessoryData.PartType Property
 The part type of the duct fitting or duct accessory.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PartType PartType { get; }
Public ReadOnly Property PartType As PartType
	Get
public:
property PartType PartType {
	PartType get ();
}
member PartType : PartType with get
Property Value
PartType
See Also
Reference
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace